---
kind: type
id: T:Autodesk.Revit.DB.Visual.AssetPropertyBoolean
source: html/ad822813-a51f-cf85-3252-5fe21b4d701b.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyBoolean

Represents a property of material.

## Syntax (C#)
```csharp
public class AssetPropertyBoolean : AssetProperty
```